// #j693ca8
// – створити інпут, який приймає вік людини, та кнопку, яка підтверджує дію. При натисканні на кнопку зчитати інформацію з інпуту та перевірити вік, чи менше він за 18,
// та повідомити про це користувача

const ageAdmission = document.getElementById('formAge');
let div = document.createElement('div');

ageAdmission.onsubmit = function (e) {
    e.preventDefault()
    const age = Number(document.getElementById('ageAdmission').value)
    if (age >= 18) {
        div.innerText = 'Ласкаво просимо!'
    } else {
        div.innerText = 'Вам немає 18'
    }
    document.body.appendChild(div);
}

// #bq1zkx7WP
// *** (подібне було вище, але…будьте уважні в другій частині) створити сторінку з довільним блоком, в середині якого є значення “100грн”
// при перезавантаженні сторінки до значення додається по 10грн, але !!! зміна ціни відбувається тільки на перезавантаження,
// які відбулись пізніше ніж 10 секунд після попереднього.
//При перезавантаженні, яке відбулось раніше ніж минуло 10 секунд, нічого не відбувається

let sum = +localStorage.getItem('number') || 100


// #NKB0tgWIK1G
// ***PAGINATION
// зробити масив на 100 об’єктів та дві кнопки prev next
// при завантаженні сторінки з’являються перші 10 об’єктів.
// При натисканні next виводяться наступні 10 об’єктів.
// При натисканні prev виводяться попередні 10 об’єктів.
